// *++
//
// Copyright (c) 2005, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution. The full text of the license may be found at         
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   DevicetreeStrings.uni
// 
// Abstract:
// 
//   String definitions for the Shell shellenv command
// 
// Revision History:
// 
// --*/ 

/=#

#langdef   eng "English"
#langdef   fra "Français"

#string STR_SHELLENV_PROTID_DEVTREE_BAD_LANG  #language eng  "%hs: Invalid language value '%hs'.\n"

#string STR_SHELLENV_PROTID_DEVTREE_INVALID_HANDLE #language eng  "devtree: Invalid handle number %hs\n"

#string STR_SHELLENV_PROTID_DEVICE_TREE #language eng  "%NDevice Tree\n"

#string STR_SHELLENV_PROTID_CTRL       #language eng  "Ctrl[%h02x] "

#string STR_SHELLENV_PROTID_ONE_VAR_S  #language eng  "%s\n"

#string STR_SHELLENV_PROTID_UNKNOWN_2  #language eng  "<UNKNOWN>\n"

#string STR_DEVTREE_LINEHELP  #language eng  "Displays the tree of devices that follow the EFI Driver Model"

#string STR_DEVTREE_VERBOSEHELP #language eng "Displays the tree of devices that follow the EFI Driver Model\n"
                                                      "\n"
                                                      "DEVTREE [-b] [-d] [-l XXX] [DeviceHandle]\n"
                                                      "\n"
                                                      "    -b           - Displays one screen at a time\n"
                                                      "    -d           - Displays device tree using device paths\n"
                                                      "    -l           - Displays device tree using the ISO 639-2 language\n"
                                                      "                   specified by XXX.\n"
                                                      "    DeviceHandle - Displays device tree below a certain handle\n"
                                                      "\n"
                                                      "Examples:\n"
                                                      "  * To display the tree of all devices that follow the EFI Driver Model:\n"
                                                      "    Shell> devtree\n"
                                                      "\n"
                                                      "  * To display the tree of all devices below device 28 that follow the\n"
                                                      "    EFI Driver Model:\n"
                                                      "    Shell> devtree 28\n"
                                                      "\n"
                                                      "  * To display the tree of all devices that follow the EFI Driver Model,\n"
                                                      "    break when screen is full:\n"
                                                      "    Shell> devtree -b\n" 
